In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv("job_candidates.csv", index_col=0)
df.to_csv('123.cvs')

In [5]:
data = {
    "name": ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'],
    "city": ['Mexico city', 'Toronto', 'Prague', 'Shanghai',                       'Manchester', 'Cairo', 'Osaka'],
    "age": [41, 28, 33, 34, 38, 31, 37],
    "py_score": [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84],
}

raw_lables = [101, 102, 103, 104, 105, 106, 107]

In [34]:
df = pd.DataFrame(data=data, index=raw_lables)
df

       name         city  age  py_score
101  Xavier  Mexico city   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

In [19]:
df = pd.read_csv('job_candidates.csv', index_col=0)
df

       name         city  age  py_score
101  Xavier  Mexico city   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

In [30]:
df.iloc[-3:]

      name        city  age  py_score
105  Robin  Manchester   38      68.0
106   Amal       Cairo   31      61.0
107   Nori       Osaka   37      84.0

In [13]:
df.head(n=2)

       name         city  age  py-score
101  Xavier  Mexico city   41      88.0
102     Ann      Toronto   28      79.0

In [46]:
df

      3Name       &_city  age  py_score
101  Xavier  Mexico city   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

In [12]:
cities = df['city']
cities[101]

'Mexico city'

In [16]:
df.loc[103]

name          Jana
city        Prague
age             33
py_score        81
Name: 103, dtype: object

### Creating a Pandas DataFrame With Dictionaries

In [21]:
d = {
    'a': [1,2,3],
    'b': np.array([888,999,000]),
    'c': 123,
}

In [22]:
df = pd.DataFrame(d)

In [23]:
df

   a    b    c
0  1  888  123
1  2  999  123
2  3    0  123

In [28]:
pd.DataFrame(data=d, index=[0,1,2], columns=['c','b','a'])

     c    b  a
0  123  888  1
1  123  999  2
2  123    0  3

In [31]:
arr = np.arange(10).reshape(2,5)
arr

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [32]:
df = pd.DataFrame(arr)

In [33]:
df

   0  1  2  3  4
0  0  1  2  3  4
1  5  6  7  8  9

In [35]:
df

       name         city  age  py_score
101  Xavier  Mexico city   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

In [36]:
df

       name         city  age  py_score
101  Xavier  Mexico city   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0